log/benchmark_50k/jruby_9_2_6_0_indy.log
$ JAVA_HOME=/opt/jdk-11.0.2 JRUBY_OPTS=-Xcompile.invokedynamic=true jruby.bash -v ~/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec ~/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]

$ ab -n 50000 -c 4 localhost:3000/posts && ab -n 10000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Completed 35000 requests
Completed 40000 requests
Completed 45000 requests
Completed 50000 requests
Finished 50000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   181.837 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      2671123360 bytes
HTML transferred:       2635950000 bytes
Requests per second:    274.97 [#/sec] (mean)
Time per request:       14.547 [ms] (mean)
Time per request:       3.637 [ms] (mean, across all concurrent requests)
Transfer rate:          14345.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:    10   14  14.9     11    1078
Waiting:       10   14  14.6     11    1068
Total:         10   15  14.9     11    1078

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     13
  75%     17
  80%     18
  90%     20
  95%     25
  98%     31
  99%     35
 100%   1078 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   30.517 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      534224286 bytes
HTML transferred:       527190000 bytes
Requests per second:    327.68 [#/sec] (mean)
Time per request:       12.207 [ms] (mean)
Time per request:       3.052 [ms] (mean, across all concurrent requests)
Transfer rate:          17095.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    10   12   2.5     11      27
Waiting:       10   12   2.5     11      27
Total:         10   12   2.5     11      27

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     11
  80%     13
  90%     17
  95%     18
  98%     18
  99%     20
 100%     27 (longest request)