log/benchmark_50k/jruby_9_2_6_0_indy.log
$ JAVA_HOME=/opt/jdk-11.0.2 JRUBY_OPTS=-Xcompile.invokedynamic=true jruby.bash -v ~/.rbenv/versions/jruby-9.2.6.0/bin/bundle exec ~/.rbenv/versions/jruby-9.2.6.0/bin/puma -e production --threads=4
jruby 9.2.6.0 (2.5.3) 2019-02-11 15ba00b OpenJDK 64-Bit Server VM 11.0.2+7 on 11.0.2+7 +indy +jit [linux-x86_64]

$ ab -n 50000 -c 4 localhost:3000/posts/1 && ab -n 10000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Completed 35000 requests
Completed 40000 requests
Completed 45000 requests
Completed 50000 requests
Finished 50000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        929 bytes

Concurrency Level:      4
Time taken for tests:   66.083 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      81621084 bytes
HTML transferred:       46450000 bytes
Requests per second:    756.63 [#/sec] (mean)
Time per request:       5.287 [ms] (mean)
Time per request:       1.322 [ms] (mean, across all concurrent requests)
Transfer rate:          1206.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     2    5   9.4      3     675
Waiting:        2    5   9.1      3     668
Total:          2    5   9.4      3     675

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      5
  80%      7
  90%     10
  95%     16
  98%     20
  99%     22
 100%    675 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        929 bytes

Concurrency Level:      4
Time taken for tests:   7.490 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      16323964 bytes
HTML transferred:       9290000 bytes
Requests per second:    1335.05 [#/sec] (mean)
Time per request:       2.996 [ms] (mean)
Time per request:       0.749 [ms] (mean, across all concurrent requests)
Transfer rate:          2128.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     3    3   0.6      3      15
Waiting:        2    3   0.5      3      15
Total:          3    3   0.6      3      15

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      4
  98%      5
  99%      6
 100%     15 (longest request)